Revit 2027 API
TessellatedShapeBuilderTarget Enumeration
 Describes what TessellatedShapeBuilder should generate, if possible.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TessellatedShapeBuilderTarget
Public Enumeration TessellatedShapeBuilderTarget
public enum class TessellatedShapeBuilderTarget
type TessellatedShapeBuilderTarget
Members
Member name | Value | Description
AnyGeometry | 1 |  A Geometry, which depending on input data can be a Solid or a 'sheet', where there is no fully enclosed volume formed by the generated faces.
Mesh | 2 |  A mesh.
Solid | 0 |  A solid, i.e., a Geometry, where all edges are shared by two and only two faces and which divides all 3d space into bounded inner and infinite outer area(s).
See Also
Reference
Autodesk.Revit.DB Namespace